app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "articles"
---
  def index
	#@articles = Article.all
    @articles = Article.paginate(:page => params[:page], :per_page => 2)

INSERT INTO "articles" ("title", "posted_on", "featured_img", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Tie knots"], ["posted_on", "2015-10-15"], ["featured_img", ""], ["content", ""], ["created_at", "2016-02-15 14:36:01.724721"], ["updated_at", "2016-02-15 14:36:01.724721"]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "featured_img" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["featured_img", "C:\\Sites\\blog\\app\\assets\\images\\mma-cage.jpg"], ["updated_at", "2016-02-18 07:13:16.921315"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)