app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "stars", "article_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["content", "great blog!"], ["stars", 5], ["article_id", 1], ["user_id", 1], ["created_at", "2016-02-22 16:59:03.218755"], ["updated_at", "2016-02-22 16:59:03.218755"]]
---
	def create
		@article = Article.find params[:article_id]
		@comment = @article.comments.new(comment_params)
		@comment.user_id = @current_user.id
		@comment.save