app/views/categories/show.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ?  [[nil, 1]]
---

<% @category.articles.each do |article| %>